#ifndef _LIB_PROC_H_
#define _LIB_PROC_H_

#include "List.h"
//константи стану рядка 
//SB - квадратні дужки []
//RB - круглі дужки ()
//FB - фігурні дужки {}
#define OK 0 //всі дужки збалансовані
#define SB_M 1 //не співпадає кількість '[' та ']'
#define SB_U 2 //неправильний порядок '[' та ']'
#define RB_M 4 //не співпадає кількість '(' та ')'
#define RB_U 8 //неправильний порядок '(' та ')'
#define FB_M 16 //не співпадає кількість '{' та '}'
#define FB_U 32 //неправильний порядок '{' та}'

//обробка стеку, аналіз балансу дужок
char process(ptr top);
//виведення результату аналізу
void show(char state);

#endif
