#include <stdio.h>
#include "dk_tool.h" /*підключення директиви, з яких препроцесор зчитує зміст файлу, що знаходиться в одній папці з виконавчим файлом, а також виконує директиви і підстановки*/

int main()
{
    float Q_1=0; //ініціалізація змнних
    float Q_2=0; //ініціалізація змнних
    float Q=0; //ініціалізація змнних
    float A,C; //ініціалізація змнних
    float B; //ініціалізація змнних
    float D=0; //ініціалізація змнних
    float sum; //ініціалізація змнних

    printf("Number A:");
    scanf("%f",&A); //зчитування значень, введених користувачем з клавіатури
    printf("\n");

    printf("Number B:");
    scanf("%f",&B); //зчитування значень, введених користувачем з клавіатури
    printf("\n");

    printf("Number C:");
    scanf("%f",&C); //зчитування значень, введених користувачем з клавіатури
    printf("\n");

    if (B + sqr(C) == 0 && B <= 0) //перевірка на те, чи дорівнює знаменник дробу нулю, а також перевірка на додатність числа В
        {
         printf(" Mistake. Denominator equals zero or B <= 0(can't count the sum of factorials)\n"); //виведення на екран повідомлення про помилку
         return 0;
        }
    else
        {
            Q_1=(A*B)/(B+sqr(C)); //обчислення першої частини рівняння(дробу) у разі успішного проходження перевірки введених значень
            printf("Q_1=%f",(A*B)/(B+sqr(C))); //виведення отриманого значення на екран
        }
    printf("\n");


    Q_2=sum_of_factorials(D,B); //обчислення другої частини рівняння(факторіалу) у разі успішного проходженн перевірки введених значень
    printf("Q_2=%f",sum_of_factorials(D,B)); //виведення отриманого значення на екран
    printf("\n");

    Q=Q_1+Q_2; //обчислення суми двох частин рівняння
    printf("Q=%f",Q_1+Q_2); //вивід на екран шуканого значення Q
}
